create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.500 [get_ports {a[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.500 [get_ports {a[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.500 [get_ports {b[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.500 [get_ports {b[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 2.500 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 3.500 [get_ports reset]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {sum_FF[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.200 [get_ports {sum_FF[*]}]
